Мета: Знайомство з A01:2025 Broken Access Control
Середовище: Kali Linux, Docker engine, OWASP WebGoat container.
Для кращого розуміння потрібно пройти попередні кроки з мануала WebGoat
В меню обираємо:
 2026-07-31-16-41-35.png
 
Предивляємось постановку завдання:
Концепція	
Розробники прикладного програмного забезпечення, які створюють власні ідентифікатори сесій (session IDs), часто забувають забезпечити рівень складності та рандомізації, необхідний для безпеки. Якщо специфічний ідентифікатор сесії користувача не є складним і випадковим, додаток стає надзвичайно вразливим до атак типу «brute force» (перебір) на сесії.
Цілі
Отримати доступ до автентифікованої сесії, що належить іншому користувачу.
 
Основні терміни:
•	Session ID — ідентифікатор сесії.
•	Complexity and randomness — складність та випадковість.
•	Brute force attacks — атаки методом грубої сили (перебору).
•	Authenticated session — автентифікована сесія (сеанс).
Далі переходимо на другу вкладинку (червоний колір означає, що потрібно буде щось зробити і це буде перевірятись)
 2026-07-31-16-41-52.png

У цьому уроці ми намагаємося передбачити значення «hijack_cookie». Файл «hijack_cookie» використовується для розрізнення автентифікованих та анонімних користувачів WebGoat.
Спробуємо дослідити за допомогою Burpsuit. Запускаємо його, переходимо на вкладинку "Proxy", запускаємо браузер, в якому відкриваємо "WebGoat" та створюємо користавача і логінуємся або одразу логінуємось (якщо не видаляли контейнер) та переходимо на другий крок:
 2026-07-31-16-42-49.png
 натискаємо "Access", отримуємо помилку та повертаємось до burpsuit, де маємо передивитись вкладинку HTTPhistory:
 2026-07-31-16-42-42.png

Далі шукаємо відповідь POST, в якої міститься інформація про цю помилку (ключ - це зміст hijack_cookie, яку нам і потрібно "передбачити"):
 2026-07-31-16-43-10.png
 
Далі натискаємо праву кнопку миші та відправляємо запит до Repeater:
 2026-07-31-16-43-18.png
 
В Repeater робимо декілька повторів (в цьому прикладі може вистачити 5+ запитів):
 2026-07-31-16-43-32.png

та бачимо, як змінюється значення hijack_cookie, копіюємо ці значення в текстовий редактор:
 
 2026-07-31-16-43-42.png
Навіть поверхневий аналіз дає висновок про логіку створення кукі, перша частина відповідає за сесію користувача, а друга скоріш за все є часовою міткою, або timestamp.
Бачимо, що між 2 5458558329372052883 та 5458558329372052885 може бути сесія 5458558329372052884. Передаємо запит з сесією 5458558329372052883 до intruder:
 2026-07-31-16-43-55.png 
 
Далі в Intruder формуємо свій запит відповідним чином:
•	додаємо hijack_cookie 5458558329372052883-1785500596122, останні дві цифри будемо змінювати, такий собі лайтовий брутфорс
 2026-07-31-16-44-16.png
 
Запускаємо start attack та чекаємо результатів перебору, однак майже одразу отримуємо результат:
 2026-07-31-16-44-24.png
Чомусь у мене не вийшло, може десь помилилась



